app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("image_url", "updated_at", "title", "price", "description", "created_at") VALUES('random', '2009-09-28 17:49:11', 'bharti public school', 300.0, 'very good school this oneq', '2009-09-28 17:49:11')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 4)
UPDATE "products" SET "description" = '<p>nice it', "updated_at" = '2009-09-28 18:19:51' WHERE "id" = 4

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT * FROM "products" WHERE ("products"."id" = 1)
DELETE FROM "products" WHERE "id" = 1