app/controllers/store_controller.rb

INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2009-11-19 02:32:42', 11, 2, 1, 47.0, '2009-11-19 02:32:42')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('kgthegreat', 'Roop Mahal, Kholi #420', '2009-11-19 02:32:42', '2009-11-19 02:32:42', 'cc', 'randomness@randomness.com')
---
  def save_order

    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save