app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order=>:name)
---
SELECT * FROM "users" WHERE ("users"."id" = 10) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password") VALUES('huhahuha', '-6117323480.926815886912431', '2009-11-22 10:57:31', '2009-11-22 10:57:31', '0911b9062f6c20730cd01cc79e65e9515beea23a')

  def destroy
    @user = User.find(params[:id])
    begin
      flash[:notice] = "User #{@user.name} deleted"
       @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 10) LIMIT 1
DELETE FROM "users" WHERE "id" = 4